apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    // Do this one frame, 8 micro frames, at a time
    while(frameCount > 0)
    {
        //
        //  Get the size of buffer for this frame
        //
        bufferSize = 0;
        for ( i = 0; i < 8; i += pEP->interval)
        {
            if(frameCount < i)
            {
                break;
            }
			
			if(lowLatency)
			{
				if (pFrames[i].frReqCount > kUSBMaxHSIsocFrameReqCount)
				{
					USBLog(3,"%s[%p]::UIMCreateIsochTransfer Isoch frame too big %d",getName(), this, pFrames[i].frReqCount);
					return kIOReturnBadArgument;
				}
				bufferSize += pFrames[i].frReqCount; 
			}
			else
			{
				if (pHLFrames[i].frReqCount > kUSBMaxHSIsocFrameReqCount)
				{
					USBLog(3,"%s[%p]::UIMCreateIsochTransfer Isoch frame too big %d",getName(), this, pHLFrames[i].frReqCount);
					return kIOReturnBadArgument;
				}
				bufferSize += pHLFrames[i].frReqCount; 
				
			}
        }
		
        //
        // go ahead and make sure we can grab at least ONE TD, before we lock the buffer	
        //
        pNewITD = AllocateITD();
        USBLog(7, "%s[%p]::UIMCreateIsochTransfer - new iTD %p", getName(), this, pNewITD);
        if (pNewITD == NULL)
        {
            USBLog(1,"%s[%p]::UIMCreateIsochTransfer Could not allocate a new iTD",getName(), this);
            return kIOReturnNoMemory;
        }
		
		pNewITD->_lowLatency = lowLatency;
		
		// initialize the page pointers to zero length
		pNewITD->GetSharedLogical()->Transaction0 = NULL;
		pNewITD->GetSharedLogical()->Transaction1 = NULL;
		pNewITD->GetSharedLogical()->Transaction2 = NULL;
		pNewITD->GetSharedLogical()->Transaction3 = NULL;
		pNewITD->GetSharedLogical()->Transaction4 = NULL;
		pNewITD->GetSharedLogical()->Transaction5 = NULL;
		pNewITD->GetSharedLogical()->Transaction6 = NULL;
		pNewITD->GetSharedLogical()->Transaction7 = NULL;
		
		// set up all the physical page pointers
		buffP = &pNewITD->GetSharedLogical()->bufferPage0;
		dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
		pageOffset = dmaStartAddr & kEHCIPageOffsetMask;
		USBLog(4, "%s[%p]::CreateHSIsochTransfer - Addr (%p) Length (%d) BufferSize (%d)", getName(), this, dmaStartAddr, segLen, bufferSize);
		if(segLen > bufferSize)
		{
			segLen = bufferSize;
		}
		if(segLen > (kEHCIPageSize-pageOffset))
		{
			segLen = kEHCIPageSize-pageOffset;
		}
		
		*(buffP++) = HostToUSBLong( dmaStartAddr & kEHCIPageMask);
		USBLog(4, "%s[%p]::CreateHSIocTransfer - getPhysicalSegment returned start of %p; length:%ld ; Buff Ptr0:%lx", getName(), this, dmaStartAddr, segLen, *(buffP-1));
		transferOffset += segLen;
		bufferSize -= segLen;
		
		for(j=1; j <= 6; j++)
		{
			if(bufferSize == 0)
			{
				*(buffP++) = 0;
				continue;
			}
			dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
			*(buffP++) = HostToUSBLong( dmaStartAddr & kEHCIPageMask);
			// pageOffset = dmaStartAddr & kEHCIPageOffsetMask;
			if((dmaStartAddr & kEHCIPageOffsetMask) != 0)
			{
				USBError(1, "%s[%p]::CreateHSIocTransfer - pageOffset not zero in %dth buff: %p", getName(), this, j, dmaStartAddr);
			}
			if(segLen > bufferSize)
			{
				segLen = bufferSize;
			}
			if(segLen > kEHCIPageSize)
			{
				segLen = kEHCIPageSize;
			}
			transferOffset += segLen;
			bufferSize -= segLen;
			USBLog(4, "%s[%p]::CreateHSIocTransfer - getPhysicalSegment returned start of %p;  length:%d ; Buff Ptr%d:%p", getName(), this, dmaStartAddr, segLen, j, USBToHostLong(*(buffP-1)));
		}
		
		//    return kIOReturnNoMemory;
        page = 0;
        TransactionP = &pNewITD->GetSharedLogical()->Transaction0;
		if(lowLatency)
		{
			pNewITD->_pFrames = (IOUSBIsocFrame *)pFrames;	// Points to the 8 frames structure for the 8 frames in this micro frame
		}
		else
		{
			pNewITD->_pFrames = pHLFrames;	// Points to the 8 frames structure for the 8 frames in this micro frame
		}
        for ( i = 0; i< 8; i += pEP->interval)
        {
            if(frameCount < i)
            {
                break;
            }
			
			if(lowLatency)
			{
				trLen = (pFrames++)->frReqCount;
			}
			else
			{
				trLen = (pHLFrames++)->frReqCount;
			}
            // Len already checked above
            USBLog(4, "%s[%p]::CreateHSIsochTransfer - forming transaction length (%d), pageOffset (%p), page (%d)", getName(), this, trLen, pageOffset, page);
            *(TransactionP++) = HostToUSBLong(kEHCI_ITDStatus_Active |  (trLen<< kEHCI_ITDTr_LenPhase) | 
											  (pageOffset << kEHCI_ITDTr_OffsetPhase) | (page << kEHCI_ITDTr_PagePhase) );
			
			// This gets filled in later for the last one.
            pNewITD->_completion.action = NULL;
			
            pageOffset += trLen;
            if(pageOffset > kEHCIPageSize)
            {
                pageOffset -= kEHCIPageSize;
                page++;
            }
        }
		
		
        if(frameCount > (UInt32)(8 / pEP->interval))
        {
            frameCount -= (8 / pEP->interval);
        }
        else
        {
            frameCount = 0;
        }
		
		// We're no longer using IOC as end of transaction marker. There's a iTD->completion field for that
		if(frames-- == 0)
		{	// We've gone 100 frames, about time to set an IOC
			TransactionP[-1] |= HostToUSBLong(kEHCI_ITDTr_IOC);
			frames = 100;
		}
		
		pNewITD->_frameNumber = frameNumberStart++;
		
        pNewITD->GetSharedLogical()->bufferPage0 |= HostToUSBLong((pEP->functionAddress << kEHCI_ITDBuf_FnAddrPhase) | (pEP->endpointNumber << kEHCI_ITDBuf_EPPhase) );
        pNewITD->GetSharedLogical()->bufferPage1 |= HostToUSBLong( (pEP->oneMPS << kEHCI_ITDBuf_MPSPhase) | ((pEP->direction == kUSBIn) ? (UInt32) kEHCI_ITDBuf_IO : 0) );
        pNewITD->GetSharedLogical()->bufferPage2 |= HostToUSBLong( (pEP->mult << kEHCI_ITDBuf_MultPhase) );
        
		pNewITD->_pEndpoint = pEP;
		pNewITD->print(4);
		PutTDonToDoList(pEP, pNewITD);
    }
	// Rember to put IOC on the last one at least.
	TransactionP[-1] |= HostToUSBLong(kEHCI_ITDTr_IOC);
	// An the completion action.
	USBLog(3,"%s[%p]::UIMCreateIsochTransfer completion completion.action %p",getName(), this, completion.action);
	pNewITD->_completion = completion;

	AddIsocFramesToSchedule(pEP);
	EnablePeriodicSchedule();

