apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    USBLog(7, "%s[%p]::UIMCreateIsochTransfer - adr=%d:%d cbp=%p:%lx (cback=[%lx:%lx:%lx])", getName(), this, functionAddress, endpointNumber, pBuffer, pBuffer->getLength(), (UInt32)completion.action, (UInt32)completion.target, (UInt32)completion.parameter);
    if ( (frameCount == 0) || (frameCount > 1000) )
    {
        USBLog(3,"%s[%p]::UIMCreateIsochTransfer bad frameCount: %d",getName(), this, frameCount);
        return kIOReturnBadArgument;
    }
    pEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);
	
    if(pEP == NULL)
    {
        USBLog(1, "%s[%p]::UIMCreateIsochTransfer - Endpoint not found", getName(), this);
        return kIOUSBEndpointNotFound;        
    }
    
    if (pEP->highSpeedHub)
		return CreateSplitIsochTransfer(pEP, completion, frameNumberStart, pBuffer, frameCount, (IOUSBIsocFrame*)pFrames, updateFrequency, true);
    else
		return CreateHSIsochTransfer(pEP, completion, frameNumberStart, pBuffer, frameCount, pFrames, updateFrequency, true);
}



void 
AppleUSBEHCI::AddIsocFramesToSchedule(AppleEHCIIsochEndpointPtr pEP)
{
    UInt64									currFrame;
    AppleEHCIIsochListElement				*pTD;
	AppleEHCISplitIsochTransferDescriptor	*pSITD;
    UInt16									nextSlot;
    AbsoluteTime							timeStamp;
	
    pTD = GetTDfromToDoList(pEP);
    if(pTD == NULL)
    {
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - no frames to add fn:%d EP:%d", getName(), this, pEP->functionAddress, pEP->endpointNumber);
		return;
    }
	
    // Don't get GetFrameNumber() unless we're going to use it
    //
    currFrame = GetFrameNumber();
    
    USBLog(7, "%s[%p]::AddIsocFramesToSchedule - fn:%d EP:%d inSlot (0x%x), currFrame: 0x%Lx", getName(), this, pEP->functionAddress, pEP->endpointNumber, pEP->inSlot, currFrame);
    clock_get_uptime(&timeStamp);
    while(pTD->_frameNumber <= (currFrame+1))	// Add 1, and use <= so you never put in a new frame 
												// at less than 2 ahead of now. (EHCI spec, 7.2.1)
    {
		IOReturn	ret;
		
		// this transaction is old before it began, move to done queue
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - ignoring TD(%p) because it is too old (%Lx) vs (%Lx) ", getName(), this, pTD, pTD->_frameNumber, currFrame);
		ret = pTD->UpdateFrameList(timeStamp);		// TODO - accumulate the return values
		if (pEP->scheduledTDs)
			PutTDonDeferredQueue(pEP, pTD);
		else
		{
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - putting TD(%p) on Done Queue instead of Deferred Queue ", getName(), this, pTD);
			PutTDonDoneQueue(pEP, pTD, true);
		}
	    
		pTD = GetTDfromToDoList(pEP);
        USBLog(7, "%s[%p]::AddIsocFramesToSchedule - pTD = %p", getName(), this, pTD);
		if(pTD == NULL)
		{	
			// Run out of transactions to move.  Call this on a separate thread so that we return to the caller right away
            // 
			// ReturnIsocDoneQueue(pEP);
            USBLog(7, "%s[%p]::AddIsocFramesToSchedule - calling the ReturnIsocDoneQueue on a separate thread", getName(), this);
            thread_call_enter1(_processDoneQueueThread, (thread_call_param_t) pEP);
			return;
		}
    }
    
    currFrame = pTD->_frameNumber;		// start looking at the first available number
    
    // This needs to be fixed up when we have variable length lists.
    pEP->inSlot = currFrame & (kEHCIPeriodicListEntries-1);
	
    do
    {
		nextSlot = (pEP->inSlot + 1) & (kEHCIPeriodicListEntries-1);
		if( nextSlot == _outSlot) 								// weve caught up with our tail
		{
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - caught up nextSlot (0x%x) _outSlot (0x%x)", getName(), this, nextSlot, _outSlot);
			break;
		}
		
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - checking TD(%p) FN(0x%Lx) against currFrame (0x%Lx)", getName(), this, pTD, pTD->_frameNumber, currFrame);
		if(currFrame == pTD->_frameNumber)
		{
			AppleEHCIListElement					*linkAfter = NULL;
			AppleEHCIIsochListElement				*prevIsochLE;				// could be split or HS
			AppleEHCISplitIsochTransferDescriptor	*prevSITD;
			
			if(_outSlot > kEHCIPeriodicListEntries)
			{
				_outSlot = pEP->inSlot;
			}
			// Place TD in list
			USBLog(6, "%s[%p]::AddIsocFramesToSchedule - linking TD (%p) with frame (0x%Lx) into slot (0x%x) - curr next log (%p) phys (%p)", getName(), 
				   this, pTD, pTD->_frameNumber, pEP->inSlot, _logicalPeriodicList[pEP->inSlot], USBToHostLong(_periodicList[pEP->inSlot]));
			pTD->print(6);
			prevIsochLE = OSDynamicCast(AppleEHCIIsochListElement, _logicalPeriodicList[pEP->inSlot]);
			while (prevIsochLE)
			{
				prevSITD = OSDynamicCast(AppleEHCISplitIsochTransferDescriptor, prevIsochLE);
				if (prevSITD)
				{
					if (pEP->direction == kUSBIn)
					{
						
						// IN SITDs have to be linked AFTER
						//	a) any DUMMY SITDs on the same TT
						//	b) any OUT SITDs on the same TT
						if (prevSITD->_pEndpoint->hiPtr == pEP->hiPtr)
						{
							if (prevSITD->_isDummySITD)
							{
								USBLog(7, "%s[%p]::AddIsocFramesToSchedule - found previous DUMMY SITD (%p) on same TT - linking after", getName(), this, prevSITD);
								linkAfter = prevSITD;
							}
							else if (prevSITD->_pEndpoint->direction == kUSBOut)
							{
								USBLog(7, "%s[%p]::AddIsocFramesToSchedule - found previous OUT SITD (%p) on same TT - linking after", getName(), this, prevSITD);
								linkAfter = prevSITD;
							}
						}
					}
					else
					{
						// OUT transaction. check frame ordering
						UInt8	oldStart = FirstScheduledSSMicroFrame(prevSITD->_pEndpoint);
						UInt8	myStart = FirstScheduledSSMicroFrame(pTD->_pEndpoint);
						UInt8	oldEnd = LastScheduledSSMicroFrame(prevSITD->_pEndpoint);
						UInt8	myEnd = LastScheduledSSMicroFrame(pTD->_pEndpoint);
						
						if ((oldStart < myStart) || ((oldStart == myStart) && (oldEnd < myEnd)))
						{
							USBLog(6, "%s[%p]::AddIsocFramesToSchedule - me[%d:%d] linking AFTER previous [%d:%d]", getName(), this, myStart, myEnd, oldStart, oldEnd);
							linkAfter = prevSITD;
						}
						else
						{
							USBLog(6, "%s[%p]::AddIsocFramesToSchedule - me[%d:%d] ignoring previous [%d:%d]", getName(), this, myStart, myEnd, oldStart, oldEnd);
						}
					}
				}
				prevIsochLE = OSDynamicCast(AppleEHCIIsochListElement, prevIsochLE->_logicalNext);
			}
			if (linkAfter)
			{
				pTD->SetPhysicalLink(linkAfter->GetPhysicalLink());
				pTD->_logicalNext = linkAfter->_logicalNext;
				linkAfter->_logicalNext = pTD;
				linkAfter->SetPhysicalLink(HostToUSBLong(pTD->GetPhysicalAddrWithType()));
			}
			else
			{
				pTD->SetPhysicalLink(_periodicList[pEP->inSlot]);
				pTD->_logicalNext = _logicalPeriodicList[pEP->inSlot];
				_logicalPeriodicList[pEP->inSlot] = pTD;
				_periodicList[pEP->inSlot] = HostToUSBLong(pTD->GetPhysicalAddrWithType());
			}
			pEP->scheduledTDs++;
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - _periodicList[%x]:%x", getName(), this, pEP->inSlot, USBToHostLong(_periodicList[pEP->inSlot]));
			// pTD->print();
			// and fetch the next one
			pTD = GetTDfromToDoList(pEP);
		}
		currFrame++;
		pEP->inSlot = nextSlot;
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - pEP->inSlot is now 0x%x", getName(), this, pEP->inSlot);	
    } while(pTD != NULL);
	
    USBLog(7, "%s[%p]::AddIsocFramesToSchedule - finished,  currFrame: %Lx", getName(), this, GetFrameNumber() );
	
